# 데이터 불러오기와 간단한 분석

In [2]:
import numpy as np
import pandas as pd

In [24]:
df = pd.read_csv('sample/sample1.csv')

In [25]:
df

   student_id  math  eng  kor
0         101    80   95   88
1         102    92   85   90
2         103    75   80   66

index는 자동으로 정수로 설정<br>columns은 첫번째 행으로 설정

In [13]:
df.set_index('student_id')

            math  eng  kor
student_id
101           80   95   88
102           92   85   90
103           75   80   66

In [49]:
df = pd.read_csv('sample/sample2.csv', encoding='euc-kr')
df

   상품명       가격  재고
0  노트북  1200000   5
1  키보드    29000  20
2  마우스    19000  15

In [50]:
df = df.set_index('상품명')
df

          가격  재고
상품명
노트북  1200000   5
키보드    29000  20
마우스    19000  15

In [54]:
print(df.index)

Index(['노트북', '키보드', '마우스'], dtype='object', name='상품명')

In [57]:
print(df.columns)

Index(['가격', '재고'], dtype='object')

In [59]:
import json
f = open('sample/sample3.json', 'r')

In [61]:
dic = json.load(f)
dic

{'id': 101, 'name': 'alice', 'age': 30}

In [64]:
f = open('sample/sample4.json', 'r', encoding='utf-8')

In [65]:
dic = json.load(f)
dic

{'name': '홍길동', 'age': 25, 'city': '서울'}

In [74]:
for key, value in dic.items():
    print(key, value)

name 홍길동
age 25
city 서울

In [75]:
f = open('sample/sample5.json', 'r', encoding='utf-8')
dic = json.load(f)
dic

[{'name': '홍길동', 'age': 25, 'city': '서울'},
 {'name': '김철수', 'age': 30, 'city': '부산'}]

In [76]:
df = pd.read_json('sample/sample5.json')
df

  name  age city
0  홍길동   25   서울
1  김철수   30   부산

In [78]:
df.loc[1]

name    김철수
age      30
city     부산
Name: 1, dtype: object

In [79]:
import sqlite3

In [84]:
con = sqlite3.connect('mydata.sqlite')

In [85]:
con.execute('CREATE TABLE student (id INTEGER, name TEXT, age INTEGER)')
con.execute('INSERT INTO student VALUES (1, "둘리", 25)')
con.execute('INSERT INTO student VALUES (2, "또치", 30)')
con.commit()

In [88]:
cur = con.execute('SELECT * From student')
rows = cur.fetchall()
for tup in rows:
    print(tup)

(1, '둘리', 25)
(2, '또치', 30)

In [89]:
cur = con.execute('SELECT * From student where id = 1')
row = cur.fetchone()
row

(1, '둘리', 25)

In [105]:
incheon = pd.read_csv('sample/OBS_ASOS_TIM_20250916161022.csv', encoding='euc-kr')
incheon

     지점 지점명                일시    기온  습도
0   112  인천   2025-09-14 1:00  22.2  84
1   112  인천   2025-09-14 2:00  21.8  86
2   112  인천   2025-09-14 3:00  21.7  87
3   112  인천   2025-09-14 4:00  21.4  87
4   112  인천   2025-09-14 5:00  21.2  87
5   112  인천   2025-09-14 6:00  21.2  87
6   112  인천   2025-09-14 7:00  21.3  87
7   112  인천   2025-09-14 8:00  22.3  86
8   112  인천   2025-09-14 9:00  22.9  85
9   112  인천  2025-09-14 10:00  23.8  82
10  112  인천  2025-09-14 11:00  24.6  79
11  112  인천  2025-09-14 12:00  25.9  71
12  112  인천  2025-09-14 13:00  26.9  64
13  112  인천  2025-09-14 14:00  27.4  61
14  112  인천  2025-09-14 15:00  27.7  65
15  112  인천  2025-09-14 16:00  27.4  70
16  112  인천  2025-09-14 17:00  27.0  68
17  112  인천  2025-09-14 18:00  26.4  70
18  112  인천  2025-09-14 19:00  25.2  73
19  112  인천  2025-09-14 20:00  24.7  78
20  112  인천  2025-09-14 21:00  24.5  82
21  112  인천  2025-09-14 22:00  24.2  85
22  112  인천  2025-09-14 23:00  23.9  84
23  112  인천   2025-09-15 0:00  23.7  84

In [117]:
temp = int(incheon['기온'].mean())
su = int(incheon['습도'].mean())
print(f'평균기온 : {temp}도, 평균습도 : {su}%')

평균기온 : 24도, 평균습도 : 78%

In [135]:
incheon.loc[incheon['기온'].idxmax()]

지점                  112
지점명                  인천
일시     2025-09-14 15:00
기온                 27.7
습도                   65
Name: 14, dtype: object